_Rarzrabotki/Kazna/DataProcessors/ДобавитьВизирующего.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ДобавитьВизирующего</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Виза_ТекущаяРоль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрользовательДобавляемый</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ИдентификацияВизирующихПоРолям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИдентификацияВизирующихПоРолям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Переадресация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переадресант</Name>
					<Comment>ИО пользователя на данной роли</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/Визы_Состояния.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Визы_Состояния</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Анулировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Черновик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаВизировании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяОплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыгруженаВКБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплаченоЧастично</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденСКомментариями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденПоСхеме</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтложеноСКомментарием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/DataProcessors/ДобавитьВизирующего/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ДобавитьНовогоВизирующегоНаСервере()
	
	Если	НЕ ЗначениеЗаполнено(Объект.Прользователь)
		ИЛИ	НЕ ЗначениеЗаполнено(Объект.Виза_ТекущаяРоль)
		ИЛИ	НЕ ЗначениеЗаполнено(Объект.ПрользовательДобавляемый) Тогда 
		
		Сообщить("Не все данные указаны");
		Возврат;
	КонецЕсли;
	лЗапрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Т.Ссылка КАК Счет
	|ИЗ
	|	Документ.СчетНаОплатуПоставщика.ТекущиеВизирующие КАК Т
	|ГДЕ
	|	Т.Пользователь = &Прользователь
	|	И Т.Ссылка.Виза_ТекущаяРоль = &Виза_ТекущаяРоль
	|	И Т.Ссылка.Виза_Состояние = &Виза_Состояние");
	лЗапрос.УстановитьПараметр("Прользователь", 	Объект.Прользователь);
	лЗапрос.УстановитьПараметр("Виза_ТекущаяРоль",	Объект.Виза_ТекущаяРоль);
	лЗапрос.УстановитьПараметр("Виза_Состояние", 	Перечисления.Визы_Состояния.НаВизировании);

	лВыборка = лЗапрос.Выполнить().Выбрать();
	Пока лВыборка.Следующий() Цикл
		лОб = лВыборка.Счет.ПолучитьОбъект();
		Если Ложь Тогда 
			лОб = Документы.СчетНаОплатуПоставщика.СоздатьДокумент();
		КонецЕсли;	
		
		Если лОб.ТекущиеВизирующие.Найти( Объект.ПрользовательДобавляемый, "Прользователь" ) = Неопределено Тогда 
			лОб.ТекущиеВизирующие.Добавить().Прользователь = Объект.ПрользовательДобавляемый;
			лОб.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовогоВизирующего(Команда)
	ДобавитьНовогоВизирующегоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПереопределитьТекущихВизирующихНаСервере( пРоль = Неопределено )
	лЗапрос 		= Новый Запрос();
	лЗапрос.Текст 	= "ВЫБРАТЬ
					|	Т.Ссылка
		            |ИЗ
		            |	Документ.СчетНаОплатуПоставщика КАК Т
		            |ГДЕ
		            |	Т.Виза_Состояние = &Виза_Состояние
					|	И (&пРоль = Неопределено ИЛИ  Т.Виза_ТекущаяРоль = &пРоль ) ";
	лЗапрос.УстановитьПараметр("Виза_Состояние", Перечисления.Визы_Состояния.НаВизировании);
	лЗапрос.УстановитьПараметр("пРоль", пРоль);
	
	
	лВыборка = лЗапрос.Выполнить().Выбрать();
	
	Пока лВыборка.Следующий() Цикл
		
		лДокОбъект = лВыборка.Ссылка.ПолучитьОбъект();
		
		лПараметры 		= Новый Структура("Подразделение, СтатьяДвиженияДенежныхСредств, ВидОплаты, Организация, Сумма, ВидЗатрат");
		ЗаполнитьЗначенияСвойств(лПараметры, лДокОбъект);
		лПараметры.Сумма= лДокОбъект.СуммаДокумента;
		лПараметры.Вставить("Роль", лДокОбъект.Виза_ТекущаяРоль);
		лМассПользователей =  РегистрыСведений.ИдентификацияВизирующихПоРолям.ПолучитьМассивПользователей(лПараметры);
		лДокОбъект.ТекущиеВизирующие.Очистить();
		Для Каждого лСтрока2 Из лМассПользователей Цикл 
			лДокОбъект.ТекущиеВизирующие.Добавить().Пользователь = лСтрока2;
		КонецЦикла;
		
		Попытка
			лДокОбъект.Записать();
		Исключение
			
		КонецПопытки;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ПереопределитьТекущихВизирующих(Команда)
	ПереопределитьТекущихВизирующихНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПереопределитьДляРолиНаСервере()
	
КонецПроцедуры

&НаКлиенте
Процедура ПереопределитьДляРоли(Команда)
	ПереопределитьТекущихВизирующихНаСервере( Объект.Виза_ТекущаяРоль );
КонецПроцедуры
